app/controllers/abouts_controller.rb

  def get_about_us
    about = About.first
---
SELECT `abouts`.* FROM `abouts` ORDER BY `abouts`.`id` ASC LIMIT 1

  def put_about_us
    about = About.first
    if about
      new_params = params.permit(:content)
      about.update(new_params)
---
SELECT `abouts`.* FROM `abouts` ORDER BY `abouts`.`id` ASC LIMIT 1
UPDATE `abouts` SET `abouts`.`content` = 'new content from the ruby team', `abouts`.`updated_at` = '2024-05-13 08:46:45.786243' WHERE `abouts`.`id` = 1

  def post_about_us
    if About.first
      render json: "about already exits, edit it using put"
    else
      new_params = params.permit(:content)
      About.create(new_params)
---
SELECT `abouts`.* FROM `abouts` ORDER BY `abouts`.`id` ASC LIMIT 1
INSERT INTO `abouts` (`content`, `created_at`, `updated_at`) VALUES ('we are the ruby team', '2024-05-13 08:46:25.763938', '2024-05-13 08:46:25.763938')