app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories`
---
  def get_categories
    categories = Category.all

SELECT `categories`.* FROM `categories` WHERE `categories`.`name` = ':shoes' LIMIT 1
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 4
SELECT `product_sizes`.* FROM `product_sizes` WHERE `product_sizes`.`product_id` = 4
SELECT `products`.* FROM `products` WHERE `products`.`category_id` = 1
---
  def get_category_product
    category = params[:category_name]
    category = Category.find_by(name: category)
    if category
      products = category.products.includes(:product_images, :product_sizes).all

SELECT `categories`.* FROM `categories` WHERE `categories`.`name` = 'example2@gmail' LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 4
---
  def delete_category
    category = Category.find_by(name: params[:category_name])
    if category
      category.destroy