app/controllers/orders_controller.rb

  def get_orders
    orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def delete_order
    order = Order.find_by(id: params[:id])
    if order
      order.destroy
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
DELETE FROM `orders` WHERE `orders`.`id` = 1

  def post_order
    new_params = params.permit(:name, :number, :email, :size, :product_id)
    order = Order.create(new_params)
---
INSERT INTO `orders` (`name`, `number`, `email`, `size`, `product_id`, `created_at`, `updated_at`) VALUES ('chalwe', '0976256275', 'chalwe@gmail.com', 'XL', 4, '2024-05-31 09:46:32.175594', '2024-05-31 09:46:32.175594')