app/controllers/products_controller.rb

  def get_products
    products = Product.includes(:product_images, :product_sizes).all
---
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` IN (4, 5)
SELECT `product_sizes`.* FROM `product_sizes` WHERE `product_sizes`.`product_id` IN (4, 5)
SELECT `products`.* FROM `products`

  def post_product
    if (!Category.exists?(name: params[:category_name]))
      category = Category.create(name: params[:category_name])
    else
      category = Category.find_by(name: params[:category_name])
    end
    category_id = category.id
    new_params = params.permit(:name, :price, :description,
                               :details, :shipping_details)
    new_params['category_id'] = category_id
    product = Product.create(new_params)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`name` = 'shoes' LIMIT 1
SELECT 1 AS one FROM `categories` WHERE `categories`.`name` = 'short' LIMIT 1
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('short', '2024-05-13 07:53:27.529517', '2024-05-13 07:53:27.529517')
SELECT `categories`.* FROM `categories` WHERE `categories`.`name` = 'shirt' LIMIT 1
INSERT INTO `products` (`name`, `price`, `description`, `details`, `shipping_details`, `category_id`, `created_at`, `updated_at`) VALUES ('top', 4.4, 'this is a very durable product', 'can be washed any way you want', 'can be collected from monk square', 3, '2024-05-13 08:18:34.843281', '2024-05-13 08:18:34.843281')

  def put_product
    if params[:category_name]
      category = Category.find_or_create_by(name: params[:category_name])
      params[:category_id] = category.id
    end
    product = Product.find_by(id: params[:id])
    if product
      new_params = params.permit(:name, :price, :description, :category_id,
                                :details, :shipping_details)
      product.update(new_params)
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('example2@gmail.com', '2024-05-13 08:26:36.936956', '2024-05-13 08:26:36.936956')
SELECT `categories`.* FROM `categories` WHERE `categories`.`name` = 'example2@gmail.com' LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `products`.`name` = 'bemuda', `products`.`price` = 25.4, `products`.`description` = 'this is a very durable product', `products`.`category_id` = 2, `products`.`updated_at` = '2024-05-13 08:01:25.809662' WHERE `products`.`id` = 4

  def delete_product
    product = Product.find_by(id: params[:id])
    if product
      product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 10 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 10