app/controllers/product_sizes_controller.rb

SELECT `product_sizes`.* FROM `product_sizes` WHERE `product_sizes`.`size` = 'S' LIMIT 1
INSERT INTO `product_sizes` (`size`, `product_id`, `created_at`, `updated_at`) VALUES ('L', 4, '2024-05-13 08:14:10.653007', '2024-05-13 08:14:10.653007')
---
  def post_size
    size = ProductSize.find_by(size: params[:size])
    if size
      render json: "size already exists"
    else
      new_params = params.permit(:product_id, :size)
      new_size = ProductSize.create(new_params)

SELECT `product_sizes`.* FROM `product_sizes` WHERE `product_sizes`.`size` = 'S' LIMIT 1
DELETE FROM `product_sizes` WHERE `product_sizes`.`id` = 3
---
  def delete_size
    size = ProductSize.find_by(size: params[:size])
    if size
      size.destroy