app/controllers/product_images_controller.rb

  def post_image
    uploaded_image = params[:image]

    if uploaded_image.present? && uploaded_image.respond_to?(:tempfile)
      file_name = Time.now.strftime("%Y%m%d%H%M%S") + '_' + uploaded_image.original_filename
      file_path = Rails.root.join('public', 'uploads', file_name)
      File.open(file_path, 'wb') do |file|
        file.write(uploaded_image.read)
      end

      image_url = "/uploads/#{file_name}"
      new_params = params.permit(:image_url, :product_id)
      new_params['image_url'] = image_url
      new_image = ProductImage.create(new_params)
---
INSERT INTO `product_images` (`image_url`, `product_id`, `created_at`, `updated_at`) VALUES ('/uploads/20240524093851_happy-dp-16.jpg', 4, '2024-05-24 07:38:51.589025', '2024-05-24 07:38:51.589025')

  def delete_image
    image = ProductImage.find_by(id: params[:id])
    if image
      file_path = 'public' + image.image_url
      print file_path
      File.delete(file_path) if File.exist?(file_path)
      print file_path
      image.destroy
---
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`id` = 1 LIMIT 1
DELETE FROM `product_images` WHERE `product_images`.`id` = 4