app/controllers/products_controller.rb

  def get_product
    product = Product.includes(:product_images, :product_sizes).find_by(id: params[:id])
---
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 9
SELECT `product_sizes`.* FROM `product_sizes` WHERE `product_sizes`.`product_id` = 9
SELECT `products`.* FROM `products` WHERE `products`.`id` = 9 LIMIT 1