app/controllers/subscribers_controller.rb

SELECT `subscribers`.* FROM `subscribers`
---
  def get_subscribers
    subscribers = Subscriber.all

SELECT `subscribers`.* FROM `subscribers` WHERE `subscribers`.`id` = 1 LIMIT 1
UPDATE `subscribers` SET `subscribers`.`email` = NULL, `subscribers`.`updated_at` = '2024-05-13 08:27:35.655488' WHERE `subscribers`.`id` = 1
---
  def put_subscriber
    subscriber = Subscriber.find(params[:id])
    if subscriber.update(email: params[:email])

INSERT INTO `subscribers` (`email`, `created_at`, `updated_at`) VALUES ('example@gmail.com', '2024-05-13 08:24:59.431037', '2024-05-13 08:24:59.431037')
---
  def post_subscriber
    new_params = params.permit(:email)
    subscriber = Subscriber.create(new_params)